SMP_BankExchange_SMB/cfe/src/Catalogs/СМП_УчетныеЗаписиБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СМП_УчетныеЗаписиБанков</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>EnumRef.СМП_ПоддерживаемыеИнтеграцииСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемаяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьНовогоКонтрагентаПриЗагрузкеВыписки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляWebHook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SMP_BankExchange_SMB/cfe/src/Catalogs/СМП_УчетныеЗаписиБанков/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "ПриватБанк") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИД");
		ПроверяемыеРеквизиты.Добавить("Токен");
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "МОНОБанк") Тогда
		
		ПроверяемыеРеквизиты.Добавить("Токен");
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "ПУМБ") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИД");
		ПроверяемыеРеквизиты.Добавить("Токен");
		ПроверяемыеРеквизиты.Добавить("Логин");
		ПроверяемыеРеквизиты.Добавить("Пароль");
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(Банк, "ПодключаемаяОбработка") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ПодключаемаяОбработка");
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПодключаемаяОбработка = Неопределено;
	ИД = "";
	Токен = "";
	Логин = "";
	Пароль = "";
	ГруппаДоступаДляНовыхКонтрагентов = Неопределено;
	СоздатьНовогоКонтрагентаПриЗагрузкеВыписки = Ложь;
	ИспользоватьРегламентныеЗадания = Ложь;
	ИдентификаторРегламентногоЗадания = Неопределено;
	АдресДляWebHook = "";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
